apache/nuttx/STM32H747_CM7.svd
        <register>
          <name>MDIOS_DINR26</name>
          <displayName>MDIOS_DINR26</displayName>
          <description>MDIOS input data register 26</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN26</name>
              <description>Input data received from MDIO Master
              during write frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DINR27</name>
          <displayName>MDIOS_DINR27</displayName>
          <description>MDIOS input data register 27</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN27</name>
              <description>Input data received from MDIO Master
              during write frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DINR28</name>
          <displayName>MDIOS_DINR28</displayName>
          <description>MDIOS input data register 28</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN28</name>
              <description>Input data received from MDIO Master
              during write frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DINR29</name>
          <displayName>MDIOS_DINR29</displayName>
          <description>MDIOS input data register 29</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN29</name>
              <description>Input data received from MDIO Master
              during write frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DINR30</name>
          <displayName>MDIOS_DINR30</displayName>
          <description>MDIOS input data register 30</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN30</name>
              <description>Input data received from MDIO Master
              during write frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DINR31</name>
          <displayName>MDIOS_DINR31</displayName>
          <description>MDIOS input data register 31</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN31</name>
              <description>Input data received from MDIO Master
              during write frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR0</name>
          <displayName>MDIOS_DOUTR0</displayName>
          <description>MDIOS output data register 0</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT0</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR1</name>
          <displayName>MDIOS_DOUTR1</displayName>
          <description>MDIOS output data register 1</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT1</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR2</name>
          <displayName>MDIOS_DOUTR2</displayName>
          <description>MDIOS output data register 2</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT2</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR3</name>
          <displayName>MDIOS_DOUTR3</displayName>
          <description>MDIOS output data register 3</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT3</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR4</name>
          <displayName>MDIOS_DOUTR4</displayName>
          <description>MDIOS output data register 4</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT4</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR5</name>
          <displayName>MDIOS_DOUTR5</displayName>
          <description>MDIOS output data register 5</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT5</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR6</name>
          <displayName>MDIOS_DOUTR6</displayName>
          <description>MDIOS output data register 6</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT6</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR7</name>
          <displayName>MDIOS_DOUTR7</displayName>
          <description>MDIOS output data register 7</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT7</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR8</name>
          <displayName>MDIOS_DOUTR8</displayName>
          <description>MDIOS output data register 8</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT8</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR9</name>
          <displayName>MDIOS_DOUTR9</displayName>
          <description>MDIOS output data register 9</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT9</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR10</name>
          <displayName>MDIOS_DOUTR10</displayName>
          <description>MDIOS output data register 10</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT10</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR11</name>
          <displayName>MDIOS_DOUTR11</displayName>
          <description>MDIOS output data register 11</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT11</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR12</name>
          <displayName>MDIOS_DOUTR12</displayName>
          <description>MDIOS output data register 12</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT12</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR13</name>
          <displayName>MDIOS_DOUTR13</displayName>
          <description>MDIOS output data register 13</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT13</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR14</name>
          <displayName>MDIOS_DOUTR14</displayName>
          <description>MDIOS output data register 14</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT14</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR15</name>
          <displayName>MDIOS_DOUTR15</displayName>
          <description>MDIOS output data register 15</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT15</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR16</name>
          <displayName>MDIOS_DOUTR16</displayName>
          <description>MDIOS output data register 16</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT16</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR17</name>
          <displayName>MDIOS_DOUTR17</displayName>
          <description>MDIOS output data register 17</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT17</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR18</name>
          <displayName>MDIOS_DOUTR18</displayName>
          <description>MDIOS output data register 18</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT18</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR19</name>
          <displayName>MDIOS_DOUTR19</displayName>
          <description>MDIOS output data register 19</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT19</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR20</name>
          <displayName>MDIOS_DOUTR20</displayName>
          <description>MDIOS output data register 20</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT20</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR21</name>
          <displayName>MDIOS_DOUTR21</displayName>
          <description>MDIOS output data register 21</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT21</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR22</name>
          <displayName>MDIOS_DOUTR22</displayName>
          <description>MDIOS output data register 22</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT22</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR23</name>
          <displayName>MDIOS_DOUTR23</displayName>
          <description>MDIOS output data register 23</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT23</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR24</name>
          <displayName>MDIOS_DOUTR24</displayName>
          <description>MDIOS output data register 24</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT24</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR25</name>
          <displayName>MDIOS_DOUTR25</displayName>
          <description>MDIOS output data register 25</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT25</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR26</name>
          <displayName>MDIOS_DOUTR26</displayName>
          <description>MDIOS output data register 26</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT26</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR27</name>
          <displayName>MDIOS_DOUTR27</displayName>
          <description>MDIOS output data register 27</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT27</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR28</name>
          <displayName>MDIOS_DOUTR28</displayName>
          <description>MDIOS output data register 28</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT28</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR29</name>
          <displayName>MDIOS_DOUTR29</displayName>
          <description>MDIOS output data register 29</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT29</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR30</name>
          <displayName>MDIOS_DOUTR30</displayName>
          <description>MDIOS output data register 30</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT30</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
